NattakornS/top-gun2013/trunk/131022_2041_STM32F4xx_PowerMeter_OLED/STM32F4xx_PowerMeter_OLED/Utilities/STM32_EVAL/STM324xAB_EVAL/stm324xab_eval.c
	GPIO_InitStructure.GPIO_Pin = DRYIN1_PIN ;
	GPIO_Init(DRYIN1_PORT, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = DRYIN2_PIN ;
	GPIO_Init(DRYIN2_PORT, &GPIO_InitStructure);
	
	/*DIP SW*/
	RCC_AHB1PeriphClockCmd(DIP_SW1_CLK|DIP_SW2_CLK, ENABLE);
	
	GPIO_InitStructure.GPIO_Pin = DIP_SW1_PIN ;
	GPIO_Init(DIP_SW1_PORT, &GPIO_InitStructure);
	
	GPIO_InitStructure.GPIO_Pin = DIP_SW2_PIN ;
	GPIO_Init(DIP_SW2_PORT, &GPIO_InitStructure);
	
	{
		EXTI_InitTypeDef EXTI_InitStructure;
		/* Connect Button EXTI Line to Button GPIO Pin */
		SYSCFG_EXTILineConfig(DRYIN1_EXTI_PORT_SOURCE, DRYIN1_EXTI_PIN_SOURCE);

		/* Configure Button EXTI line */
		EXTI_InitStructure.EXTI_Line = DRYIN1_EXTI_LINE;
		EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;

		EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;  
		
		EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		EXTI_Init(&EXTI_InitStructure);

		/* Connect Button EXTI Line to Button GPIO Pin */
		SYSCFG_EXTILineConfig(DRYIN2_EXTI_PORT_SOURCE, DRYIN2_EXTI_PIN_SOURCE);

		/* Configure Button EXTI line */
		EXTI_InitStructure.EXTI_Line = DRYIN2_EXTI_LINE;
		EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;

		EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;  
		
		EXTI_InitStructure.EXTI_LineCmd = ENABLE;
		EXTI_Init(&EXTI_InitStructure);

		/* Enable and set Button EXTI Interrupt to the lowest priority */
		NVIC_InitStructure.NVIC_IRQChannel = DRYIN1_EXTI_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVIC_InitStructure); 
	
		/* Enable and set Button EXTI Interrupt to the lowest priority */
		NVIC_InitStructure.NVIC_IRQChannel = DRYIN2_EXTI_IRQn;
		NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0E;
		NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
		NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVIC_InitStructure); 
	}
	
	ioStat.relay[0] = RELAY_ST_OFF;
	ioStat.relay[1] = RELAY_ST_OFF;
	
	ioStat.dip[0] = (DIP_STATUS)GPIO_ReadInputDataBit(DIP_SW1_PORT, DIP_SW1_PIN);
	ioStat.dip[1] = (DIP_STATUS)GPIO_ReadInputDataBit(DIP_SW2_PORT, DIP_SW2_PIN);
			
	ioStat.needAnnouce = true;
	ioStat.needUpdate = true;
}
void DRYIN1_IRQHandler()
{
	if(EXTI_GetITStatus(DRYIN1_EXTI_LINE) == SET)
	{
		ioStat.needAnnouce = true;
		/* Clear the EXTI line pending bit */
		EXTI_ClearITPendingBit(DRYIN1_EXTI_LINE);
	}
	if(EXTI_GetITStatus(BLUE_BTN_EXTI_LINE) == SET)
	{
		BlueBtnPressed = 0x01;
		/* Clear the EXTI line pending bit */
		EXTI_ClearITPendingBit(BLUE_BTN_EXTI_LINE);
	}
}
void DRYIN2_IRQHandler()
{
	ioStat.needAnnouce = true;
	/* Clear the EXTI line pending bit */
	EXTI_ClearITPendingBit(DRYIN2_EXTI_LINE);
}
void abEval_RelaySet(Relay_TypeDef idx, RELAY_STATUS stat)
{
	if(idx < nRelay)
	{
		ioStat.relay[idx] = stat;
		ioStat.needUpdate = true;
	}
}
void abEval_RelayToggle(Relay_TypeDef idx)
{
	if(idx < nRelay)
	{
		ioStat.relay[idx] = (ioStat.relay[idx]==RELAY_ST_OFF)?RELAY_ST_ON:RELAY_ST_OFF;
		ioStat.needUpdate = true;
	}
}
char reportIO_Zb[32];
void abEval_IOProcess(void)
{
	if(ioStat.needAnnouce)
	{
		ioStat.needAnnouce = false;
		ioStat.dryin[0] = (DRYIN_STATUS)DRYIN1_STATUS();
		ioStat.dryin[1] = (DRYIN_STATUS)DRYIN2_STATUS();
		
		if(ioStat.dryin[DRYIN1] == DRYIN_ST_Z) {
			LEDx_ON(LED3);
		}
		else {
			LEDx_OFF(LED3);
		}
		
		if(ioStat.dryin[DRYIN2] == DRYIN_ST_Z) {
			LEDx_ON(LED4);
		}
		else {
			LEDx_OFF(LED4);
		}
		
		/* "d00" */
		sprintf(reportIO_Zb, "d%d%d\0", ioStat.dryin[0], ioStat.dryin[1]);
		dgZigbeeApiSendString(0, reportIO_Zb);
	}
	
	if(ioStat.needUpdate)
	{
		ioStat.needUpdate = false;
		RELAY1_SET(ioStat.relay[0]);
		RELAY2_SET(ioStat.relay[1]);

		if(ioStat.relay[RELAY1] == RELAY_ST_ON) {
			LEDx_ON(LED1);
		}
		else {
			LEDx_OFF(LED1);
		}
		
		if(ioStat.relay[RELAY2] == RELAY_ST_ON) {
			LEDx_ON(LED2);
		}
		else {
			LEDx_OFF(LED2);
		}
		/* "d00" */
		sprintf(reportIO_Zb, "r%d%d\0", ioStat.relay[0], ioStat.relay[1]);	
		dgZigbeeApiSendString(0, reportIO_Zb);
	}
	
#ifdef DIP_SW1_PIN
	{
		static uint16_t dipTick = 0;
		if((getVar_Time_Rec_Base()-dipTick)>100)	/*1000 ms*/
		{
			if(GPIO_ReadInputDataBit(DIP_SW1_PORT, DIP_SW1_PIN) != ioStat.dip[0])
			{
				abEval_RelayToggle(RELAY1);
				ioStat.dip[0] = GPIO_ReadInputDataBit(DIP_SW1_PORT, DIP_SW1_PIN);
			}
			
			if(GPIO_ReadInputDataBit(DIP_SW2_PORT, DIP_SW2_PIN) != ioStat.dip[1])
			{
				abEval_RelayToggle(RELAY2);
				ioStat.dip[1] = GPIO_ReadInputDataBit(DIP_SW2_PORT, DIP_SW2_PIN);
			}
			
			dipTick = getVar_Time_Rec_Base();
		}
	}
#endif
}

uint8_t abEval_getDryin(Dryin_TypeDef idx)
{
	return (uint8_t)ioStat.dryin[idx];
}
uint8_t abEval_getRelay(Relay_TypeDef idx)
{
	return (uint8_t)ioStat.relay[idx];
}

/**
  * @brief  Configures LED GPIO.
  * @param  Led: Specifies the Led to be configured. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4
  * @retval None
  */
void STM_EVAL_LEDInit(Led_TypeDef Led)
{
  GPIO_InitTypeDef  GPIO_InitStructure;
  
  /* Enable the GPIO_LED Clock */
  RCC_AHB1PeriphClockCmd(GPIO_CLK[Led], ENABLE);


  /* Configure the GPIO_LED pin */
  GPIO_InitStructure.GPIO_Pin = GPIO_PIN[Led];
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
  GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_UP;
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_Init(GPIO_PORT[Led], &GPIO_InitStructure);
}

/**
  * @brief  Turns selected LED On.
  * @param  Led: Specifies the Led to be set on. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4  
  * @retval None
  */
void STM_EVAL_LEDOn(Led_TypeDef Led)
{
  GPIO_PORT[Led]->BSRRL = GPIO_PIN[Led];
}

/**
  * @brief  Turns selected LED Off.
  * @param  Led: Specifies the Led to be set off. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4 
  * @retval None
  */
void STM_EVAL_LEDOff(Led_TypeDef Led)
{
  GPIO_PORT[Led]->BSRRH = GPIO_PIN[Led];  
}

/**
  * @brief  Toggles the selected LED.
  * @param  Led: Specifies the Led to be toggled. 
  *   This parameter can be one of following parameters:
  *     @arg LED1
  *     @arg LED2
  *     @arg LED3
  *     @arg LED4  
  * @retval None
  */
void STM_EVAL_LEDToggle(Led_TypeDef Led)
{
  GPIO_PORT[Led]->ODR ^= GPIO_PIN[Led];
}

/**
  * @brief  Configures Button GPIO and EXTI Line.
  * @param  Button: Specifies the Button to be configured.
  *   This parameter can be one of following parameters:   
  *     @arg BUTTON_WAKEUP: Wakeup Push Button
  *     @arg BUTTON_TAMPER: Tamper Push Button  
  *     @arg BUTTON_KEY: Key Push Button 
  *     @arg BUTTON_RIGHT: Joystick Right Push Button 
  *     @arg BUTTON_LEFT: Joystick Left Push Button 
  *     @arg BUTTON_UP: Joystick Up Push Button 
  *     @arg BUTTON_DOWN: Joystick Down Push Button
  *     @arg BUTTON_SEL: Joystick Sel Push Button
  * @param  Button_Mode: Specifies Button mode.
  *   This parameter can be one of following parameters:   
  *     @arg BUTTON_MODE_GPIO: Button will be used as simple IO 
  *     @arg BUTTON_MODE_EXTI: Button will be connected to EXTI line with interrupt
  *                     generation capability  
  * @retval None
  */
void STM_EVAL_PBInit(Button_TypeDef Button, ButtonMode_TypeDef Button_Mode)
{
  GPIO_InitTypeDef GPIO_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;
  NVIC_InitTypeDef NVIC_InitStructure;


  /* Enable the BUTTON Clock */
  RCC_AHB1PeriphClockCmd(BUTTON_CLK[Button], ENABLE);
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_SYSCFG, ENABLE);

  /* Configure Button pin as input */
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
  GPIO_InitStructure.GPIO_Pin = BUTTON_PIN[Button];
  GPIO_Init(BUTTON_PORT[Button], &GPIO_InitStructure);


  if (Button_Mode == BUTTON_MODE_EXTI)
  {
    /* Connect Button EXTI Line to Button GPIO Pin */
    SYSCFG_EXTILineConfig(BUTTON_PORT_SOURCE[Button], BUTTON_PIN_SOURCE[Button]);

    /* Configure Button EXTI line */
    EXTI_InitStructure.EXTI_Line = BUTTON_EXTI_LINE[Button];
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;

    if(Button != BUTTON_WAKEUP)
    {
      EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;  
    }
    else
    {
      EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising;  
    }
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    NVIC_InitStructure.NVIC_IRQChannel = BUTTON_IRQn[Button];
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0F;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x0F;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;

    NVIC_Init(&NVIC_InitStructure); 
  }
}

/**
  * @brief  Returns the selected Button state.
  * @param  Button: Specifies the Button to be checked.
  *   This parameter can be one of following parameters:    
  *     @arg BUTTON_WAKEUP: Wakeup Push Button
  *     @arg BUTTON_TAMPER: Tamper Push Button  
  *     @arg BUTTON_KEY: Key Push Button 
  *     @arg BUTTON_RIGHT: Joystick Right Push Button 
  *     @arg BUTTON_LEFT: Joystick Left Push Button 
  *     @arg BUTTON_UP: Joystick Up Push Button 
  *     @arg BUTTON_DOWN: Joystick Down Push Button
  *     @arg BUTTON_SEL: Joystick Sel Push Button    
  * @retval The Button GPIO pin value.
  */
uint32_t STM_EVAL_PBGetState(Button_TypeDef Button)
{
  return GPIO_ReadInputDataBit(BUTTON_PORT[Button], BUTTON_PIN[Button]);
}


/**
  * @brief  Configures COM port.
  * @param  COM: Specifies the COM port to be configured.
  *   This parameter can be one of following parameters:    
  *     @arg COM1
  *     @arg COM2  
  * @param  USART_InitStruct: pointer to a USART_InitTypeDef structure that
  *   contains the configuration information for the specified USART peripheral.
  * @retval None
  */
void STM_EVAL_COMInit(COM_TypeDef COM, USART_InitTypeDef* USART_InitStruct)
{
  GPIO_InitTypeDef GPIO_InitStructure;

